// 콘솔창을 띄운다.
// 자동으로 붙게 되어있습니다.
#include <iostream>

int main()
{ // 함수의 시작
    // 이안에 어떠한 내용을 적으로 해서
    // 게임이 만들어지게 되는 개념
    // 당연히 플레이어를 만들고
    // 몬스터를 만드는 방법을 먼저 알고 싶겠지만
    // 숫자를 하나 선언하는방법에 대해서 알아보겠습니다.
    
    // 함수의 시작과 함수의 끝 사이를
    // 스코프 혹은 지역이라고 부릅니다.

    // 지역에 선언된 숫자
    // 지역에 선언된 메모리라고 합니다.
    10; // <= 이런 고정된 숫자를 상수라고 부릅니다.
    
    // 정의해서 놨습니다. <= c++ 표준엣
    // 열거형
    // 사용자 정의 자료형
    // 정수형
    // 실수형
    // 논리형

    // 이런 형들에는
    // 그것을 표현하기 위한 자료형이 있고
    // 그다음에 이름을 붙여주는것이 기본입니다.

    //  자료형  이름
    //  메모리라고
        int     PlayerAtt;
        int     PlayerDef;
        int     MonsterHp;
        int     MontsterAtt;

    // 정수 Att를 만들어야 해.
    // 자료형이 표현하는 의미가 있고
    // 이름이 표현하는 의미가 있게 됩니다.

    // 자료형의 의미
    // 1. 바이트 크기 int는 4바이트 입니다.
    // 2. 처리형태 <= 그리고 정수다

    // 이름이 의미하는것
    // 1. 위치 <= 내 프로그램의 시작위치에서 n(계속 바뀔수)바이트 떨어진 위치에 만들어진다.
    //         <= 주소값으로  

} // 함수의 끝

